## 📋 Schema Provisioning Plan

### Request Details
- **Catalog:** `dev_catalog`
- **Schema Key:** `test_workflow_schema`
- **Schema Name:** `test_workflow_schema`
- **Group:** `demo_analytics_group`
- **Environment:** `dev`

### Terraform Plan
<details>
<summary>Click to view full plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.databricks_permissions["test_workflow_schema"].databricks_grant.schema_grant will be created
  + resource "databricks_grant" "schema_grant" {
      + id         = (known after apply)
      + principal  = "demo_analytics_group"
      + privileges = [
          + "CREATE_TABLE",
          + "SELECT",
          + "USE_SCHEMA",
        ]
      + schema     = "dev_catalog.test_workflow_schema"
    }

  # module.databricks_schema["test_workflow_schema"].databricks_schema.this will be created
  + resource "databricks_schema" "this" {
      + catalog_name                   = "dev_catalog"
      + comment                        = "Testing GitHub Actions workflow with manual approval"
      + enable_predictive_optimization = (known after apply)
      + force_destroy                  = false
      + id                             = (known after apply)
      + metastore_id                   = (known after apply)
      + name                           = "test_workflow_schema"
      + owner                          = (known after apply)
      + properties                     = {
          + "created_by"  = "ryan.rabold@databricks.com"
          + "environment" = "dev"
          + "purpose"     = "workflow_testing"
          + "team"        = "platform"
        }
      + schema_id                      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + permissions = {
      + analytics_dev        = {
          + granted_privileges = [
              + "USE_SCHEMA",
              + "CREATE_TABLE",
              + "SELECT",
              + "MODIFY",
            ]
          + principal          = "demo_analytics_group"
          + schema_full_name   = "dev_catalog.analytics_dev"
        }
      + demo_analytics_dev   = {
          + granted_privileges = [
              + "USE_SCHEMA",
              + "CREATE_TABLE",
              + "SELECT",
              + "MODIFY",
            ]
          + principal          = "demo_analytics_group"
          + schema_full_name   = "dev_catalog.demo_analytics_dev"
        }
      + test_new_schema      = {
          + granted_privileges = [
              + "USE_SCHEMA",
              + "CREATE_TABLE",
              + "SELECT",
            ]
          + principal          = "demo_analytics_group"
          + schema_full_name   = "dev_catalog.test_new_schema"
        }
      + test_workflow_schema = {
          + granted_privileges = [
              + "USE_SCHEMA",
              + "CREATE_TABLE",
              + "SELECT",
            ]
          + principal          = "demo_analytics_group"
          + schema_full_name   = "dev_catalog.test_workflow_schema"
        }
    }
  + schemas     = {
      + analytics_dev        = {
          + schema_full_name = "dev_catalog.analytics_dev"
          + schema_id        = (known after apply)
          + schema_name      = (known after apply)
        }
      + demo_analytics_dev   = {
          + schema_full_name = "dev_catalog.demo_analytics_dev"
          + schema_id        = (known after apply)
          + schema_name      = (known after apply)
        }
      + test_new_schema      = {
          + schema_full_name = "dev_catalog.test_new_schema"
          + schema_id        = (known after apply)
          + schema_name      = (known after apply)
        }
      + test_workflow_schema = {
          + schema_full_name = "dev_catalog.test_workflow_schema"
          + schema_id        = (known after apply)
          + schema_name      = "test_workflow_schema"
        }
    }

Warning: Resource targeting is in effect

You are creating a plan with the -target option, which means that the result
of this plan may not represent all of the changes requested by the current
configuration.

The -target option is not for routine use, and is provided only for
exceptional situations such as recovering from errors or mistakes, or when
Terraform specifically suggests to use it as part of an error message.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
</details>

---

### ✅ Next Steps

1. **Review the plan above** carefully
2. **Merge this PR** if the plan looks correct
3. The schema will be provisioned automatically after approval

> ⚠️ **Note:** The schema will only be created after you approve the deployment in the next workflow step.
